aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio_WICED_DMA.c
static void _stm32_sdio_enable_irq(const SD_TypeDef* instance, uint32_t priority, bool en_irq);

//...dma ? static void _stm32_sdio_enable_irq(const SD_TypeDef* instance, uint32_t priority, bool en_irq);

static void _stm32_sdio_enable_hw_block(cyhal_sdio_t* obj);
static void _stm32_sdio_disable_hw_block(const cyhal_sdio_t* obj);

static uint32_t _stm32_sdio_get_cmd_resp4(SDIO_TypeDef* SDMMCx);
static uint32_t _stm32_sdio_get_cmd_resp5(SDIO_TypeDef* SDMMCx, uint8_t SD_CMD, uint32_t* data);

static uint32_t _stm32_safe_divide(uint32_t num, uint32_t denom);


/***************************************************************************************************
 * stm32_cypal_sdio_hw_init
 **************************************************************************************************/
uint32_t stm32_cypal_sdio_hw_init(SD_HandleTypeDef* hsd)
{
    /* Check the parameters */
    assert_param(NULL != hsd);

    _cyhal_sdio_handle = hsd;
    return 0;
}


void my_sdio_isr_installer(void)
{
	IRQ_DIRECT_CONNECT(MY_SDIO_IRQ, MY_SDIO_PRIO, stm32_cyhal_sdio_irq_handler, MY_IRQ_FLAGS);
	irq_enable(MY_SDIO_IRQ);
}


void my_dma2_isr_installer(void)
{
	IRQ_DIRECT_CONNECT(MY_DMA2_IRQ, MY_DMA2_PRIO, stm32_cyhal_dma2_irq_handler, MY_IRQ_FLAGS);
	irq_enable(MY_DMA2_IRQ);
}





/***************************************************************************************************
 * cyhal_sdio_init
 **************************************************************************************************/

cy_rslt_t cyhal_sdio_init(cyhal_sdio_t* obj, cyhal_gpio_t cmd, cyhal_gpio_t clk, cyhal_gpio_t data0,
                          cyhal_gpio_t data1, cyhal_gpio_t data2, cyhal_gpio_t data3)
{
    (void)cmd;
    (void)clk;
    (void)data0;
    (void)data1;
    (void)data2;
    (void)data3;
    uint32_t sdmmc_clk;


    /* ANN: Wiced adopted code*/
#if defined (WICED)

    cy_rtos_init_semaphore(&sdio_transfer_finished_semaphore, 1, 0);

    /*  Turn on SDIO IRQ */
    SDIO->ICR = (uint32_t) 0xffffffff;
    /* Must be lower priority than the value of configMAX_SYSCALL_INTERRUPT_PRIORITY */
    /* otherwise FreeRTOS will not be able to mask the interrupt */
    /* keep in mind that ARMCM3 interrupt priority logic is inverted, the highest value */
    /* is the lowest priority */
    NVIC_EnableIRQ( ( IRQn_Type ) SDIO_IRQ_CHANNEL );
    NVIC_EnableIRQ( ( IRQn_Type ) DMA2_3_IRQ_CHANNEL );
#endif


    //ANN: WICED - SDIO_DeInit( );
    __HAL_RCC_SDIO_CLK_ENABLE();
    __HAL_RCC_SDIO_CLK_DISABLE();

    hsd.Instance = SDIO;

    // Update obj sd handle
      obj->hsd = &hsd; //_cyhal_sdio_handle;

      stm32_cypal_sdio_hw_init(&hsd);

    // Init the low level hardware : GPIO, CLOCK, CORTEX...etc
       if (obj->hsd->State == HAL_SD_STATE_RESET)
       {
           // Allocate lock resource and initialize it
           obj->hsd->Lock = HAL_UNLOCKED;

           HAL_SD_MspInit(obj->hsd);
       }
#if defined (WICED)
       /*!< Enable the SDIO AHB Clock and the DMA2 Clock */
    do {
	   __IO uint32_t tmpreg;
	   SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);

	   // Delay after an RCC peripheral clock enabling
	   tmpreg = READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA2EN);
	   UNUSED(tmpreg);
	   } while(0);

#if defined (SDIO)
    {
    	if (obj->hsd->Instance == SDIO)
    	{
    	do {
    	   __IO uint32_t tmpreg;
    	   SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);

    	   // Delay after an RCC peripheral clock enabling
    	   tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);
    	   UNUSED(tmpreg);
    	   } while(0);
    	}
    }
    #endif
#endif //WICED

//ANN added below
    sdio_init_structure.ClockDiv = (uint8_t)0;
    sdio_init_structure.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    //sdio_init_structure.ClockBypass = 0;
    sdio_init_structure.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    sdio_init_structure.BusWide = SDIO_BUS_WIDE_4B; //ANN: as per WICED 1B
    sdio_init_structure.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;


    (void)SDIO_Init(obj->hsd->Instance, sdio_init_structure);
    (void)SDIO_PowerState_ON(obj->hsd->Instance);
    (void)SDIO_SetSDMMCReadWaitMode(obj->hsd->Instance, SDIO_READ_WAIT_MODE_CLK);
/*
    hsd.Init.ClockDiv = (uint8_t)120; //ANN from WICED
    hsd.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    hsd.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    hsd.Init.BusWide = SDIO_BUS_WIDE_1B; //ANN: as per WICED
    hsd.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;


    // Check the parameters
    assert_param(NULL != obj);

    // Update obj sd handle
    obj->hsd = &hsd; //_cyhal_sdio_handle;

    // Check the SD handle allocation
    if (obj->hsd == NULL)
    {
        return (cy_rslt_t)HAL_ERROR;
    }

    // Enable SDIO block
    _stm32_sdio_enable_hw_block(obj);
*/

    // Init Clock should be less or equal to 400Khz
    //sdmmc_clk = (LL_RCC_GetSDIOClockFreq(LL_RCC_SDIO_CLKSOURCE))/120;

    //__HAL_RCC_SDIO_CLK_DISABLE();

    hsd.Instance->CLKCR |= SDIO_CLKCR_CLKEN;

       // Initialize the error code
    obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;

    // store object in handle context
    obj->hsd->Context = (uint32_t)obj;

    // Initialize the SD state
    obj->hsd->State = HAL_SD_STATE_READY;

    SDIO->MASK = 0; //ANN disabling all SDIO interrupts

    my_sdio_isr_installer();
    my_dma2_isr_installer();

    // Enable interrupts
    _stm32_sdio_enable_irq(obj->hsd->Instance, CYHAL_SDIO_IRQ_PRIORITY, true);

    return CY_RSLT_SUCCESS;
}

//ANN added below function
//void SDMMC1_IRQHandler(void )
//void SDIO_IRQHandler(void)
/*void SDIO_irq(void)
{
    stm32_cyhal_sdio_irq_handler();
}*/



/***************************************************************************************************
 * cyhal_sdio_configure
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_configure(cyhal_sdio_t* obj, const cyhal_sdio_cfg_t* config)
{
    uint32_t clk_freq;

    /* Check the parameters */
    assert_param(NULL != obj);

