aniruddhanalgirkar-eaton/wifi_stm/drivers/wifi/infineon_wifi/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio_WICED_DMA.c
        /* Send the command */
        SDIO->ARG = argument;
        SDIO->CMD = (uint32_t) ( CYHAL_SDIO_CMD_IO_RW_EXTENDED | SDIO_RESPONSE_SHORT | SDIO_WAIT_NO | SDIO_CPSM_ENABLE );

        /* Wait for the whole transfer to complete */

        result = cy_rtos_semaphore_get( &sdio_transfer_finished_semaphore, (uint32_t) 50 );
        sem_count++;

        WPRINT_WHD_DEBUG( ("J_semaphore_result = %d\n",result) );
        WPRINT_WHD_DEBUG( ("J_sem_count = %d\n",sem_count) );

        if ( result != WHD_SUCCESS )
        {
        	WPRINT_WHD_INFO( ("J_semaphore failed\n") );
            goto exit;
        }

        if ( sdio_transfer_failed == true )
        {
            goto restart;
        }

        /* Check if there were any SDIO errors */
        if ( ( SDIO->STA & ( SDIO_STA_DTIMEOUT | SDIO_STA_CTIMEOUT ) ) != 0 )
        {
            goto restart;
        }
        else if ( ( ( SDIO->STA & ( SDIO_STA_CCRCFAIL | SDIO_STA_DCRCFAIL | SDIO_STA_TXUNDERR | SDIO_STA_RXOVERR ) ) != 0 ) )
        {
           // wiced_assert( "SDIO communication failure", 0 );
            goto restart;
        }

         /* Wait till complete */
        loop_count = (uint32_t) SDIO_TX_RX_COMPLETE_TIMEOUT_LOOPS;
        do
        {
            loop_count--;
            if ( loop_count == 0 || ( ( SDIO->STA & SDIO_ERROR_MASK ) != 0 ) )
            {
                goto restart;
            }
        } while ( ( SDIO->STA & ( SDIO_STA_TXACT | SDIO_STA_RXACT ) ) != 0 );

        if ( direction == BUS_READ )
        {
            memcpy( data, dma_data_source, (size_t) user_data_size );
        }
    }

	    if ( response != NULL )
    {
        *response = SDIO->RESP1;
    }
    result = WHD_SUCCESS;

exit:
    //platform_mcu_powersave_enable();
    SDIO->MASK = SDIO_MASK_SDIOITIE;
    return result;

}
//#endif
/***************************************************************************************************
 * cyhal_sdio_register_callback
 **************************************************************************************************/
void cyhal_sdio_register_callback(cyhal_sdio_t* obj, cyhal_sdio_event_callback_t callback,
                                  void* callback_arg)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != callback);

    /* Store callback info */
    obj->callback     = (void*)callback;
    obj->callback_arg = callback_arg;
}


/***************************************************************************************************
 * cyhal_sdio_enable_event
 **************************************************************************************************/
void cyhal_sdio_enable_event(cyhal_sdio_t* obj, cyhal_sdio_event_t event, uint8_t intr_priority,
                             bool enable)
{
    (void)intr_priority;
    if (enable)
    {
        __HAL_SD_ENABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        obj->irq |= (uint32_t)event;
    }
    else
    {
        __HAL_SD_DISABLE_IT(obj->hsd, SDIO_IT_SDIOIT);
        obj->irq &= ~(uint32_t)event;
    }
}

ISR_DIRECT_DECLARE(stm32_cyhal_dma2_irq_handler)
{
    whd_result_t result;

    /* Clear interrupt */
    DMA2->LIFCR = (uint32_t) (0x3F << 22);

    //result = host_rtos_set_semaphore( &sdio_transfer_finished_semaphore, WHD_TRUE );
    result = cy_rtos_semaphore_set( &sdio_transfer_finished_semaphore );
    sem_count--;
    //WPRINT_WHD_DEBUG( ("J_semaphore = %d\n",result) );

    /* check result if in debug mode */
     //WPRINT_WHD_DEBUG( "failed to set dma semaphore", result == WHD_SUCCESS );

    /*@-noeffect@*/
    (void) result; /* ignore result if in release mode */
    /*@+noeffect@*/
}

/***************************************************************************************************
 * stm32_cyhal_sdio_irq_handler
 **************************************************************************************************/
//void stm32_cyhal_sdio_irq_handler(void)
ISR_DIRECT_DECLARE(stm32_cyhal_sdio_irq_handler)
{
#if defined (WICED)
	uint32_t intstatus = SDIO->STA;

	    //WHD_BUS_STATS_INCREMENT_VARIABLE( sdio_intrs );
	#if defined(STM32F412xG)
	    if (current_command == SDIO_CMD_5)
	        SDIO->ICR = SDIO_ICR_CCRCFAILC;
	#endif
	    if ( ( intstatus & ( SDIO_STA_CCRCFAIL | SDIO_STA_DCRCFAIL | SDIO_STA_TXUNDERR | SDIO_STA_RXOVERR  | SDIO_STA_STBITERR )) != 0 )
	    {
	       // WHD_BUS_STATS_INCREMENT_VARIABLE( error_intrs );
	        //wiced_assert("sdio error flagged",0);
	        sdio_transfer_failed = WHD_TRUE;
	        SDIO->ICR = (uint32_t) 0xffffffff;

	        cy_rtos_semaphore_set( &sdio_transfer_finished_semaphore );
	        //WPRINT_WHD_INFO( ("J_sdio_transfer_failed\n") );
	        sem_count--;
	        //WPRINT_WHD_DEBUG( ("sem_count after set=%d\n",sem_count) );


	    }
	    else
	    {
	        if ((intstatus & (SDIO_STA_CMDREND | SDIO_STA_CMDSENT)) != 0)
	        {
	            if ( ( SDIO->RESP1 & 0x800 ) != 0 )
	            {
	                sdio_transfer_failed = WHD_TRUE;
	                cy_rtos_semaphore_set( &sdio_transfer_finished_semaphore );
	                //WPRINT_WHD_DEBUG( ("sdio_transfer_failed\n") );
	                sem_count--;
	                //WPRINT_WHD_DEBUG( ("sem_count after set=%d\n",sem_count) );
	            }
	            else if (current_command == CYHAL_SDIO_CMD_IO_RW_EXTENDED)
	            {
	                if (current_transfer_direction == BUS_WRITE)
	                {
	                    DMA2_Stream3->CR = DMA_MEMORY_TO_PERIPH |
	                    		DMA_CHANNEL_4 | DMA_PINC_DISABLE | DMA_MINC_ENABLE |
								DMA_PDATAALIGN_WORD | DMA_MDATAALIGN_WORD |
								DMA_NORMAL | DMA_PRIORITY_VERY_HIGH |
								DMA_MBURST_INC4 | DMA_PBURST_INC4 | DMA_SxCR_PFCTRL | DMA_SxCR_EN | DMA_SxCR_TCIE;
	                }
	                else
	                {
	                    DMA2_Stream3->CR = DMA_PERIPH_TO_MEMORY |
	                    		DMA_CHANNEL_4 | DMA_PINC_DISABLE | DMA_MINC_ENABLE |
								DMA_PDATAALIGN_WORD | DMA_MDATAALIGN_WORD |
								DMA_NORMAL | DMA_PRIORITY_VERY_HIGH |
								DMA_MBURST_INC4 | DMA_PBURST_INC4 | DMA_SxCR_PFCTRL | DMA_SxCR_EN | DMA_SxCR_TCIE;
	                }
	            }

	            /* Clear all command/response interrupts */
	            SDIO->ICR = (SDIO_STA_CMDREND | SDIO_STA_CMDSENT);
	        }

	        /* Check whether the external interrupt was triggered */
	    if ( ( intstatus & SDIO_STA_SDIOIT ) != 0 )
	        {
	            /* Clear the interrupt and then inform WICED thread */
	            SDIO->ICR = SDIO_ICR_SDIOITC;

	            whd_thread_notify_irq( );
	        }
	            /* Clear the interrupt */
	               //     __HAL_SD_CLEAR_FLAG(_cyhal_sdio_handle, SDIO_FLAG_SDIOIT);

